Revit 2026 API

# ConnectorAssignedPipeFlowConfiguration Property

---

The pipe flow configuration type of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PipeFlowConfigurationType AssignedPipeFlowConfiguration { get; }
```
```vb
Public ReadOnly Property AssignedPipeFlowConfiguration As PipeFlowConfigurationType
	Get
```
```cpp
public:
property PipeFlowConfigurationType AssignedPipeFlowConfiguration {
	PipeFlowConfigurationType get ();
}
```
```fsharp
member AssignedPipeFlowConfiguration : PipeFlowConfigurationType with get
```

#### Property Value

PipeFlowConfigurationType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance. |
| InvalidOperationException | Thrown on failure to get pipe flow configuration. |

Assigned pipe flow configuration may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace